import { useState } from 'react'
import heroImg from './assets/hero.png'
import reactLogo from './assets/react.svg'
import viteLogo from './assets/vite.svg'
import './App.css'

function App() {
  

  return (
     <div> 

<p style={{ color: 'white', width: '300px', height: '300px', background: 'black' }}>«Менталист» — адамдардың мінез-құлқын зерттейтін қызықты детективтік сериал. Басты кейіпкер Патрик Джейн өзінің байқағыштығы мен ерекше ақыл-ойының арқасында күрделі қылмыстарды ашады.</p>
<p style={{ color: 'rgb(255, 147, 62)', width: '300px', height: '300px', background: 'rgb(255, 250, 211)' }}>Патрик Джейн — өте ақылды және тапқыр адам. Ол адамдардың бет-әлпетін, дауысын және қимылдарын бақылап, олардың не ойлап тұрғанын түсінуге тырысады. Оның ерекше қабілеті тергеу кезінде үлкен көмек береді.</p>
<p style={{ color: 'purple', width: '300px', height: '300px', background: 'gray' }}>Сериалда Патрик Джейн Калифорния тергеу бюросының қызметкерлерімен бірге жұмыс істейді. Ол Тереза Лисбон және оның командасымен бірге түрлі қылмыстарды зерттеп, күдіктілерді анықтайды. Әрбір бөлімде жаңа жұмбақтар мен қызықты оқиғалар кездеседі.</p>
<p style={{ color: 'rgb(255, 177, 177)', width: '300px', height: '300px', background: 'rgb(46, 41, 16)' }}>«Менталист» сериалы көрермендерді логикалық ойлауға және адамдарды мұқият бақылауға үйретеді. Сериалдың басты ерекшелігі — күтпеген оқиғалар, қызықты тергеулер және Патрик Джейннің ерекше ойлау қабілеті. Сондықтан бұл сериал детектив жанрын ұнататын адамдарға өте қызықты.</p>
      
  )
}



export default App
